/**
 * Этот класс представляет один шаг в пути, сгенерированный алгоритмом A * pathfinding 
 * Путевые точки состоят из местоположения, предыдущей путевой точки в пути 
 * и некоторых значений стоимости, используемых для определения наилучшего пути.
 **/
public class Waypoint
{
    /** Расположение этой путевой точки. **/
    Location loc;

    /**
     * Предыдущая путевая точка в этом пути или <code> null </ code>, если это 
     * корень поиска A *.
     **/
    Waypoint prevWaypoint;

    /**
     * В этом поле хранится общая предыдущая стоимость проезда от начального 
     * местоположения до этой путевой точки через цепочку путевых точек. Это
     * фактическая стоимость следования по пути; это не включает никаких оценок. 
     **/
    private float prevCost;

    /**
     * В этом поле хранится оценка оставшейся стоимости проезда от 
     * этой путевой точки до конечного пункта назначения.
     **/
    private float remainingCost;


    /**
     * Построить новую путевую точку для указанного местоположения. 
     * При желании можно указать предыдущую путевую точку,
     * или ссылка может быть <code> null </ code>, чтобы 
     * указать, что путевая точка является началом пути.
     **/
    public Waypoint(Location loc, Waypoint prevWaypoint)
    {
        this.loc = loc;
        this.prevWaypoint = prevWaypoint;
    }

    /** Возвращает местоположение путевой точки. **/
    public Location getLocation()
    {
        return loc;
    }
    
    /**
     * Возвращает предыдущую путевую точку в пути или <code> null </ code>, если это 
     * начало пути. 
     **/
    public Waypoint getPrevious()
    {
        return prevWaypoint;
    }
    
    /**
     * Этот мутатор позволяет установить предыдущую и оставшуюся стоимость 
     * в одном вызове метода. Обычно эти значения будут установлены в одно и то же 
     * время в любом случае. 
     **/
    public void setCosts(float prevCost, float remainingCost)
    {
        this.prevCost = prevCost;
        this.remainingCost = remainingCost;
    }

    /**
     * Возвращает фактическую стоимость проезда к этой точке из начального 
     * местоположения через серию путевых точек в этой цепочке. 
     **/
    public float getPreviousCost()
    {
        return prevCost;
    }

    /**
     * Возвращает оценку оставшейся стоимости проезда от этой 
     * точки до конечного пункта назначения.
     **/
    public float getRemainingCost()
    {
        return remainingCost;
    }

    /**
     * Возвращает оценку общей стоимости для этой путевой точки. Сюда входит 
     * фактическая стоимость проезда до этой точки из начального местоположения плюс 
     * оценка оставшейся стоимости проезда от этой точки до 
     * конечного пункта назначения. 
     **/
    public float getTotalCost()
    {
        return prevCost + remainingCost;
    }
}
